testing/admin-loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 1
      name: "Warming up"
    - duration: 22
      arrivalRate: 1
      rampTo: 2
      name: "Ramping up"
    - duration: 15
      arrivalRate: 3
      name: "Sustained load"
  processor: "./processor.js"
 
scenarios:
  - name: "Create an Account flow"
    flow:
      - get:
          url: "/admin/"
      - think: 1
      - get:
          url: "/admin/forgot"
      - think: 2
      - get:
          url: "/admin/register"
      - think: 3
      - post:
          url: "/admin/register"
          beforeRequest: generateAdminCreateAccData
          json:
            firstName: "{{ firstName }}"
            lastName: "{{ lastName }}"
            email: "{{ email }}"
            phone: "{{ phone }}"
            password: "{{ password }}"
            businessName: "{{ businessName }}"
            businessType: "{{ businessType }}"
            municipality: "{{ municipality }}"
      # - get:
      #     url: "/admin/"
      # - think: 3
      # - post:
      #     url: "/admin/"
      #     beforeRequest: generateLoginData
      #     json: 
      #     email: "{{ email }}"
      #     password: "{{ password }}"